---
created: 2023-10-16T10:37
updated: 2023-11-19T17:10
---
# Развертывание коммутируемой сети с резервными каналами

## Топология
![](Pasted%20image%2020231019163911.png)
![attachments](https://github.com/2lama2/otus_engineer_pro/blob/master/attachments/Pasted%20image%2020231019163911.png?raw=true)

## Таблица адресации
| **Устройство** | **Интерфейс** | **IP-адрес** | **Маска подсети** |
|:---------------|:--------------|:-------------|:------------------|
| **SW1**             | VLAN 1        | 192.168.1.1  | 255.255.255.0     |
| **SW2**             | VLAN 1        | 192.168.1.2  | 255.255.255.0     |
| **SW3**             | VLAN 1        | 192.168.1.3  | 255.255.255.0     |

## Задачи
1. Создание сети и настройка основных параметров устройства
2. Выбор корневого моста
3. Наблюдение за процессом выбора протоколом STP порта, исходя из стоимости портов
4. Наблюдение за процессом выбора протоколом STP порта, исходя из приоритета портов

---

## 1. Создание сети и настройка основных параметров устройства

Создадим модель сети в **EVE-NG** и выполним базовую настройку коммутаторов **SW1**,  **SW2** и **SW3** по следующему шаблону:

![[cisco - базовая конфигурация]]

Выполним настройку коммутаторов в соответствии с таблицей адресации и проверим доступность коммутаторов между собой:

```
SW1#ping 192.168.1.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms

SW1#ping 192.168.1.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.3, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
```

```
SW2#ping 192.168.1.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.3, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
```

## 2. Выбор корневого моста

 Для каждого коммутатора отключим все порты:

```
SW(config)# interface range e0/0-3
SW(config-if-range)# shutdown
```

Переведем задействованные порты в режим магистрали:

```
SW(config-if-range)# switchport trunk encapsulation dot1q
SW(config-if-range)# switchport mode trunk
```

Включим те порты, которые объединят наши коммутаторы в кольцо (**SW1{Et0/0**, **Et0/3}**; **SW2{Et0/0**, **Et0/2}**; **SW3{Et0/0**, **Et0/3}**):

```
SW1(config)# int r e0/0, e0/3
SW1(config-if-range)# no sh

SW2(config)# int r e0/0, e0/2
SW2(config-if-range)# no sh

SW3(config)# int r e0/0, e0/3
SW3(config-if-range)# no sh
```

Для каждого коммутатора выполним команду **`show spanning-tree`** :

```
SW1#show spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.1000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p 
Et0/3               Desg FWD 100       128.4    P2p 
```

```
SW2#show spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.2000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p 
Et0/2               Desg FWD 100       128.3    P2p 
```

```
SW3#show spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             Cost        100
             Port        4 (Ethernet0/3)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.3000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Altn BLK 100       128.1    P2p 
Et0/3               Root FWD 100       128.4    P2p 
```

По результатам выполнения команд заполним следующую таблицу:

| Коммутатор | Инт1: Роль/Сост | Инт2: Роль/Сост | MAC           |
 |------------|-----------------|-----------------|---------------|
 | SW1         |Et0/0: Desg/FWD  |Et0/3: Desg/FWD  |aabb.cc00.1000 |
 | SW2         |Et0/0: Root/FWD  |Et0/2: Desg/FWD  |aabb.cc00.2000 |
 | SW3         |Et0/0: Altn/BLK  |Et0/3: Root/FWD  |aabb.cc00.3000 |

Проанализировав вывод команд, можно сделать следующие выводы:

- корневым мостом является коммутатор **SW1**
> Приоритет идентификатора моста рассчитывается путем сложения значений приоритета и расширенного идентификатора системы. Расширенным идентификатором системы является номер сети VLAN. В нашем случае все три коммутатора имеют равные значения приоритета идентификатора моста, равные 32769 (32769 = 32768 + 1, где приоритет по умолчанию = 32768, номер сети VLAN = 1). Следовательно, коммутатор с самым низким значением MAC-адреса, становится корневым мостом.
- корневыми портами являются: **SW2{Et0/0}** и **SW3{Et0/3}**
- назначенными портами являются: **SW1{Et0/0, Et0/3}** и **SW2{Et0/2}**
- в качестве альтернативного порта выбран: **SW3{Et0/0}**
> Альтернативным данный порт выбран алгоритмом STA потому, что, имея одинаковую стоимость пути до корневого моста с портом **SW2{Et0/2}**, он имеет больший mac-адрес и уступает роль назначенного порта вышеуказанному **SW2{Et0/2}**, а значит, становится альтернативным портом.

## 3. Наблюдение за процессом выбора протоколом STP порта, исходя из стоимости портов

Уменьшим стоимость корневого порта коммутатора **SW3{Et0/3}** на единицу:

```
S3(config)# interface e0/3
S3(config-if)# spanning-tree cost 99
```

Проверим изменения, которые произвел алгоритм STA:

```
SW2#sh spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.2000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p 
Et0/2               Altn BLK 100       128.3    P2p
```

```
SW3#sh spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             Cost        99
             Port        4 (Ethernet0/3)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.3000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p 
Et0/3               Root FWD 99        128.4    P2p
```

В результате видим, что STA заблокировал порт **SW2{Et0/2}** и выбрал назначенным порт **SW3{Et0/0}** в связи с тем, что стоимость пути до корневого моста через порт **SW3{Et0/0}** стала меньше на единицу по сравнению со стоимостью пути через порт **SW2{Et0/2}**.

Вернем прежнее значение стоимости порта **SW3{Et0/3}**:

```
SW3(config)# interface e0/3
SW3(config-if)# no spanning-tree cost 99
```

STA в результате изменений привел систему в начальное состояние.

```
SW2#sh spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.2000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  15  sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p 
Et0/2               Desg FWD 100       128.3    P2p
```

```
SW3#sh spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             Cost        100
             Port        4 (Ethernet0/3)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.3000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Altn BLK 100       128.1    P2p 
Et0/3               Root FWD 100       128.4    P2p
```

## 4. Наблюдение за процессом выбора протоколом STP порта, исходя из приоритета портов

Добавим дополнительные связи между коммутаторами, включив порты **SW1{Et0/1**, **Et0/2}**; **SW2{Et0/1**, **Et0/3}**; **SW3{Et0/1, Et0/2}**:

```
SW1(config)# int r e0/1-2
SW1(config-if-range)# no sh

SW2(config)# int r e0/1,e0/3
SW2(config-if-range)# no sh

SW3(config)# int r e0/1-2
SW3(config-if-range)# no sh
```

Изучим работу алгоритма STA при дополнительных избыточных связях:

```
SW1#sh spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.1000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p 
Et0/1               Desg FWD 100       128.2    P2p 
Et0/2               Desg FWD 100       128.3    P2p 
Et0/3               Desg FWD 100       128.4    P2p
```

```
SW2#sh spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.2000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p 
Et0/1               Altn BLK 100       128.2    P2p 
Et0/2               Desg FWD 100       128.3    P2p 
Et0/3               Desg FWD 100       128.4    P2p
```

```
SW3#sh spanning-tree 

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.1000
             Cost        100
             Port        3 (Ethernet0/2)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.3000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Altn BLK 100       128.1    P2p 
Et0/1               Altn BLK 100       128.2    P2p 
Et0/2               Root FWD 100       128.3    P2p 
Et0/3               Altn BLK 100       128.4    P2p
```

В результате работы STA, корневыми были выбраны порты **SW2{Et0/0}** и **SW3{Et0/2}**.
> Данные порты были выбраны корневыми т.к., если стоимости портов равны (а они равны), процесс сравнивает BID. Если BID равны (а они равны), для определения корневого порта используются приоритеты портов. Значение приоритета по умолчанию — 128. STA объединяет приоритет порта с номером порта. Наиболее низкие значения являются предпочтительными. Таким образом, в соответствии с приоритетами и номерами рассматриваемых портов, были выбраны вышеуказанные.


## Вопросы для повторения
---
> [!question] Вопрос
> Какое значение протокол STP использует первым после выбора корневого моста, чтобы определить выбор порта?

> Первым проверяется стоимость портов.

> [!question] Вопрос
> Если первое значение на двух портах одинаково, какое следующее значение будет использовать протокол STP при выборе порта?

> Далее проверяется Bridge ID.

> [!question] Вопрос
> Если оба значения на двух портах равны, каким будет следующее значение, которое использует протокол STP при выборе порта?
 
> Следующее значение для сравнения - приоритет порта (128 по умолчанию) и номер порта.
